module.exports = {
    id: 'groupProject',
    classroomName: 'პროექტი',
    deadline: '2022-01-31',
    // this is data dir where projects will be saved
    testFileName: '../../../data/',
    module: 'groupProject',
    emailTemplates: {
        invalid: submission => {
            const errorsWord = submission.results.length > 1 ? 'შეცდომები' : 'შეცდომა'
            const errorsBody = submission.results.map(r => `
                    <p><strong>${r.details}</strong></p>
                `).join('\n')
            return `
                <p>
                    შენი ატვირთული ფაილები არ არის ვალიდური და პროექტი <strong>არ არის მიღებული</strong>.
                    იმისთვის, რომ პროექტში შეფასება მიიღო, გამოასწორე ეს ${errorsWord}:
                </p>
                
                <div>
                    ${errorsBody}
                </div>
            `
        },
        passed: submission => `
            <p>პროექტის ფაილები მიღებულია, მაგრამ <strong>რომ არ გაგინულდეს</strong> გადაამოწმე ეს ინფორმაცია:</p>
            
            <p>${submission.results[0]}</p>
            
            <p>გუნდის სახელი ყველა წევრს <strong>ზუსტად</strong>ერთნაირი უნდა გეწეროთ. წინააღმდეგ შემთხვევაში პროგრამაში
            პლაგიატად დაფიქსირდება და <strong>განულდება</strong>. ამის უზრუნველყოფა შეგიძლიათ იმით, რომ ყველამ
             ერთი zip ფაილი ატვირთოთ</p>
            
            <p>თუ რომელიმე გუნდელს ვერ ცნობ, წევრებმა შეცვალეთ გუნდის სახელი და თავიდან ატვირთეთ</p>
          
            <p>პროექტში ცვლილებების შეტანის შემთხვევაში გუნდის  ყველა წევრმა თავიდან უნდა ატვირთოს ფაილები. სამწუხაროდ
            არადეტერმინისტულია რომელი წევრის ფაილები მომივა შესწორებისას და ამიტომ არის საჭირო ყველას ბოლო ვერსია
             გქონდეთ ატვირთული, ბოდიშს გიხდი დისკომფორტისთვის</p>
             
             <p>შეფასებას მიიღებ დედლაინიდან 2 კვირის განმავლობაში, მაგრამ ქულის გაუმჯობესებაში რომ დაგეხმაროთ, 
             ყოველ დღე გადავხედავ ხოლმე ატვირთულ ფაილებს და ამ მეილის გამოგზავნამდე
              <a href="https://freeuni-digital-technologies.github.io/info/project#შენიშვნები">
             საიტზე პროექტის გვერდზე</a> დავამატებ სხვადასხვა
             ნამუშევრებიდან შეგროვებულ შენიშვნებს.</p>
            
        `

    }
}
