module.exports = {
    id: 'hw8',
    classroomName: 'დავალება 8',
    deadline: '2021-12-31',
    testFileName: '../../../webHwInterface/server-tests/hw8/server.js',
    module: 'web',
    emailTemplates: {
        passed: s => `
            გამარჯობა,

            ბოლო დავალებაც ჩაბარებულია :) იმედია სახალისო აქტივობა იყო და სხვა დავალებებიც საინტერესო და პროდუქტიული აღმოჩნდა შენთვის. მიუხედავად იმისა, რომ რთულ კოდის წერასა და გაგებაზე არ გვივარჯიშია, შენი პროგრესი უზარმაზარია - დამოუკიდებლად გადალახე უცხოს შიში, გამოიმუშავე ნებისყოფა, ნახე როგორ ხდება კომპლექსური საკითხების დეკომპოზიცია და დეტალების გაფილტვრა/სორტირება. 

            ჩემთვისაც ძალიან მნიშვნელოვანი სემესტრი იყო. მოულოდნელად ბევრი დრო წაიღო დიდმა ცვლილებებმა იმისთვის, რომ სამუშაო გარემო უფრო კომფორტული და კონსისტენციული ყოფილიყო, მაგრამ ვფიქრობ რომ გაუმჯობესება ამად ღირდა. საბოლოო ჯამში, ჩემი მთავარი სურვილია საკუთარი შრომით ამაყობდე და მომავალში მნიშვნელოვან რთულ გამოწვევებზე უარი არ თქვა მარტო იმიტომ , რომ შეუძლებელი გგონია.

            სხვა ინფორმაციას ამ დღეებში გავუზიარებ მთელ კურსს. სასიამოვნო დასვენებას და ბედნიერ ახალ წელს გისურვებ!

            ია <3 
        `
    }
} 
